
var num=+prompt('Please write first number:');
var b =+prompt('Please erite degree:') || 2;
var num2=1;
for (let i = 0; i<b;i++ ){
console.log(num2=num2*num);
    
}alert(num2);

// var num=+prompt('Please write first number:');
// var b =+prompt('Please erite degree') || 2;
// var num2=1;
// for (let i = 0; i<b;i++ )

var kol=+prompt('Write num:')||5;
var sym=+prompt('Write indent:');
var  end=prompt('write end ');
for (let i = 0; i<kol;  i++) {
  console.log(sym+end);
 sym=sym+end;
}alert(sym);
// Задание: (ЛЕСТНИЦА)
// создаются 3 переменные в которые вводятся данные 
  
// 1) Колличество = если Колличество равно NaN то должно по умолчанию быть 5 и колличество ступень не может быть 0, проверка будет продолжаться пока не придет верный результат;
// 2) символ отступов = символ отступов не может быть пустым, проверка будет продолжаться пока не придет верный результат;
// 3) конечный символ = конечный символ не может быть пустым, проверка будет продолжаться пока не придет верный результат;
   

// При помощи цикла и склеивания вы должны создать лестницу
// все ступени выводятся в консоль разработчика

// Например:
//     переменная Колличество = 5
//     переменная символ отступов = -
//     переменная конечный символ = *
    
//     результат:
//         *
//         -*
//         --*
//         ---*
//         ----*
// -->


// Задание: (ВОЗВЕДЕНИЯ В СТЕПЕНЬ)
// создаются 2 переменные в которые вводятся данные
//     1) число = Число не может быть NaN и не может быть 0;
//     2) степень = если степень равно NaN или 0 то должно по умолчанию быть 2;

// При помощи цикла и арифметики Вы долнжи возводить в степень и результат вывести в модельное окно
//     Например:
//         число = 5
//         степень = 3
//         (5 * 5 * 5)
//         ответ = 125
// -->


































